Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: the integer operation provides scalar context for the <> operator, which responds by reading one line from STDIN and passing it back to the integer operation, which will then find the integer value of that line and return that.
es_es: la operación int establece un contexto escalar para el operador <>, que responde leyendo una línea de STDIN y enviándola de vuelta a la operación int, la cual entonces busca el valor entero de esa línea y lo devuelve.

source: You can always put another block inside of it (for C<next>) or around it (for C<last>) to do that sort of thing.
es_es: Siempre puede poner otro bloque dentro de él (para C<next>) o alrededor de él (para C<last>) para hacer esta suerte de cosas.

source: white wine
es_es: vino blanco

source: PerlIO::via layers can now have an optional UTF8 method to indicate whether the layer wants to "auto-:utf8" the stream.
es_es: Las capas PerlIO::via pueden tener ahora un método UTF8 opcional para indicar cuándo la capa requiere que el flujo active ":utf8" de forma automática.

source: B<WARNING>: Use of lexical (C<my>) variables in these blocks is broken.
es_es: B<AVISO>: El uso de variables léxicas (C<my>) en estos bloques está roto.

source: my $parens = qr/(\((?:[^()]++|(?-1))*+\))/;
es_es: my $parentesis = qr/(\((?:[^()]++|(?-1))*+\))/;

source: xX Make x and X act as alignment commands.
es_es: xX Hace x y X actuar como comandos de alineamiento.

source: normal tomato
es_es: tomate normal

source: (That is, all characters not matching C</[A-Za-z_0-9]/> will be preceded by a backslash in the returned string, regardless of any locale settings.) This is the internal function implementing the C<\Q> escape in double-quoted strings.
es_es: (Es decir, todos los caracteres que no se ajusten a C</[A-Za-z_0-9]/> serán precedidos por una barra invertida en la cadena devuelta, con independencia de cualquier configuración regional). Esta es la función interna que implementa el escapado de C<\Q> en las cadenas con doble entrecomillado.

source: eval "\$$x++"; # CASE 5
es_es: eval "\$$x++"; # CASO 5

source: Therefore C<-> in C<tr'''> and C<y'''> is treated literally as a hyphen and no character range is available.
es_es: Por lo tanto, C<-> en C<tr'''> y C<y'''> es tratado, literalmente, como un guion, y por lo tanto no está disponible un intervalo de caracteres.

source: PerlIO will become The Default.
es_es: PerlIO se convertirá en el predeterminado.

source: Since Perl 5.8.1 the ordering can be different even between different runs of Perl for security reasons (see L<perlsec/"Algorithmic Complexity Attacks">).
es_es: Desde Perl 5.8.1 la ordenación puede ser diferente incluso entre diferentes ejecuciones de Perl por razones de seguridad (ver L<perlsec/"Ataques por Complejidad Algorítmica">).

source: This sets @ARGV to all plain text files if no @ARGV was given:
es_es: Esto establecerá @ARGV a todos los archivos de texto sin formato si no se indicó nada a @ARGV:

source: A word that has no other interpretation in the grammar will be treated as if it were a quoted string.
es_es: Una palabra que no tiene otra interpretación en la gramática será tratada como si fuera una cadena entrecomillada.

source: RedHat users should see https://rhn.redhat.com/errata/RHBA-2003-136.html and consider upgrading their glibc.
es_es: Los usuarios de RedHat deberían ver la página https://rhn.redhat.com/errata/RHBA-2003-136.html y considerar la actualización de sus glibc.

source: || die "open failed: $!";
es_es: || die "falló el open: $!";

source: Those loops that scan for many short constant strings (including the constant parts of more complex patterns) will benefit most.
es_es: Los bucles que escanean por muchas cadenas constantes cortas (incluidas las partes constante de patrones más complejos) serán los más beneficiados.

source: One more rule is needed to understand how a match is determined for the whole regular expression: a match at an earlier position is always better than a match at a later position.
es_es: Una regla más que se necesita para entender cómo se determina una coincidencia por parte de la expresión regular completa: una coincidencia en una posición anterior es siempre mejor que una coincidencia en una posición más tardía.

source: Starting with Perl 5.14, C<each> can take a scalar EXPR, which must hold reference to an unblessed hash or array.
es_es: A partir de Perl 5.14, C<each> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: =item close FILEHANDLE X<close>
es_es: =item close IDENTIFICADOR_ARCHIVO X<close>

source: @info = stat($file) || die; # oops, scalar sense of stat!
es_es: @info = stat($archivo) || die; # ¡oops, sentido escalar de stat!

source: Note that under Perls older than 5.8.0, Perl uses the standard C library's' fdopen() to implement the C<=> functionality.
es_es: Tenga en cuenta que si está usando un Perl más viejo que 5.8.0, Perl usa las bibliotecas estándar C de fdopen() para implementar la funcionalidad de C<=>.

source: s/my.STRING/foo/is;
es_es: s/mi.CADENA/foo/is;

source: In particular macros which create temporary local variables now name these variables more defensively, which should avoid bugs where names clash.
es_es: En ciertas macros que crean variables locales temporales se nombra ahora estas variables de forma más defensiva, que deberían evitar errores con la coincidencia de nombres.

source: die "/etc/games is no good";
es_es: die "/etc/games no está bien";

source: eval { $x }; # CASE 4
es_es: eval { $x }; # CASO 4

source: perl589delta Perl changes in version 5.8.9
es_es: perl589delta Cambios en la versión 5.8.9

source: You probably shouldn't rely upon the C<warn()> being podded out forever.
es_es: Probablemente no se dará cuenta de que el C<warn()> ha sido comentado para siempre.

source: When it is likely that new data types may be later introduced into the system, and will need to be handled by existing code
es_es: Cuando es probable que los nuevos tipos de datos pueden ser posteriormente introducidos en el sistema, y tendrán que ser manejados por el código existente

source: fix a bug in the security taint checking of open()
es_es: arreglado un error en la comprobación de seguridad aceitosa de open()

source: It does not check the full stack, but only the name of the innermost active recursion.
es_es: No comprueba la pila completa, sino sólo el nombre de la recursión activa más interna.

source: -C Same for inode change time (Unix, may differ for other platforms)
es_es: -C Lo mismo, para el cambio de la fecha del inodo (en Unix, puede diferir en otras plataformas)

source: C<mkpath> now preserves C<errno> when C<mkdir> fails
es_es: C<mkpath> ahora preserva C<errno> cuando C<mkdir> falla

source: To use a here-document to assign an array, one line per element, you might use an approach like this:
es_es: Para usar un documento embebido para asignar a un array, una línea por elemento, puede usar un enfoque como este:

source: /(?s-i:more.*than).*million/i
es_es: /(?s-i:más.*que).*millones/i

source: @days[3,4,5] # same as ($days[3],$days[4],$days[5])
es_es: @dias[3,4,5] # igual que ($dias[3],$dias[4],$dias[5])

source: Global matching, and keep the Current position after failed matching.
es_es: Coincidencia global, y almacenar la posición actual después de una coincidencia fallida.

source: Perl uses the same mechanism to produce C<$1>, C<$2>, etc, so you also pay a price for each pattern that contains capturing parentheses.
es_es: Perl utiliza el mismo mecanismo para producir C<$1>, C<$2>, etc, por lo que también paga un precio para cada patrón que contenga paréntesis de captura.

source: You can use parentheses for functions' arguments or omit them according to your personal taste.
es_es: Puede escribir los argumentos de las funciones entre paréntesis u omitir los paréntesis, si lo prefiere.

source: Should you instead prefer an exception, do this:
es_es: Si en vez de eso, prefiere una excepción, haga lo siguiente:

source: If you don't know what license to use, dual licensing under the GPL and Artistic licenses (the same as Perl itself) is a good idea.
es_es: Si no sabe qué licencia usar, es una buena idea el licenciamiento dual bajo la GPL y la licencia Artistic (la misma que Perl).

source: Run C<perldoc perldoc> to learn more things you can do with F<perldoc>.
es_es: Ejecute C<perldoc perldoc> para ver qué más puede hacer con <perldoc>.

source: =item system PROGRAM LIST
es_es: =item system PROGRAMA LISTA

source: Useless use of integer addition in void context at - line 1.
es_es: Useless use of integer addition in void context at - line 1. (Inútil uso de suma de enteros en contexto void en - línea 1)

source: chr() on a negative value now gives C<\x{FFFD}>, the Unicode replacement character, unless when the C<bytes> pragma is in effect, where the low eight bytes of the value are used.
es_es: chr() de un valor negativo ahora da C<\x{FFFD}>, el carácter Unicode de reemplazo, salvo si está activo el pragma C<bytes>, en cuyo caso se utiliza los ocho bits más bajos, del valor indicado.

source: The C<av_*()> functions, used to manipulate arrays, no longer accept null C<AV*> parameters.
es_es: Las funciones C<av_*()>, usadas para manipular array, ya no aceptan parámetros C<AV*> nulos.

source: As far as I can tell, this is caused by a bug in the BeOS pipes implementation that occurs when starting other child processes.
es_es: Por lo que puedo decir, es causado por un error en la implementación de las tuberías en BeOS que se produce cuando se inicia otro proceso hijo.

source: Do not confuse this behavior with the behavior of backslash within a string, although both forms do convey the notion of protecting the next thing from interpolation.
es_es: No se debe confundir este comportamiento con el comportamiento de una barra diagonal inversa en una cadena, aunque ambas formas transmiten la idea de proteger a lo que sigue de ser interpolado.

source: while (my $line = <STDIN>) { print $line }
es_es: while (my $linea = <STDIN>) { print $linea }

source: Returns the current priority for a process, a process group, or a user.
es_es: Devuelve la prioridad actual de un proceso, un grupo de procesos o un usuario.

source: Similar to numeric backreferences, except that the group is designated by name and not number.
es_es: Similar a las referencias inversas numéricas, excepto que el grupo es designado por nombre y no por número.

source: perl594delta Perl changes in version 5.9.4
es_es: perl594delta Cambios en la versión 5.9.4

source: =item flags
es_es: =item banderas

source: The C<$hints> and C<$bitmask> values are subject to change between versions of Perl, and are not meant for external use.
es_es: Los valores C<$hints> y C<$bitmask> están sujetos a cambios entre versiones de Perl y no se espera que sean utilizados para uso externo.

source: The core, the standard Perl library, the optional modules, and the documentation you're reading now were all written by volunteers.
es_es: El núcleo, la biblioteca Perl estándar, los módulos opcionales y esta documentación han sido desarrollados por voluntarios.

source: \S A non-whitespace character
es_es: [parcial]\S Coincide con un carácter que en es espacio en blanco

source: Ternary "?:" is the conditional operator, just as in C. It works much like an if-then-else.
es_es: Ternario "?:" es el operador condicional, al igual que en C. Funciona como un if-then-else.

source: S_ISENFMT($mode) S_ISWHT($mode)
es_es: S_ISENFMT($modo) S_ISWHT($modo)

source: Binary "<=" returns true if the left argument is numerically less than or equal to the right argument.
es_es: Binario "<=" devuelve verdadero si el argumento de la izquierda es numéricamente menor o igual que el argumento de la derecha.

source: $sq = square(8);
es_es: $sq = cuadrado(8);

source: A new operator C<//> (defined-or) has been implemented.
es_es: Se ha implementado un nuevo operador: C<//> (definido-o).

source: If you want to write conditionals without curly brackets there are several other ways to do it.
es_es: Si quiere escribir condicionales sin llaves hay varias formas de hacerlo.

source: Declaring a subroutine allows a subroutine name to be used as if it were a list operator from that point forward in the program.
es_es: Declarar una subrutina permite que su nombre sea usado como si fuera un operador de lista, desde el punto de vista del programa.

source: Patch, extend or subclass an existing module where possible
es_es: Parchee, amplíe o derive de un módulo existente siempre que sea posible

source: Contents
es_es: Contenido

source: @a = @b ? @b : @c; # this works fine, though
es_es: @a = @b ? @b : @c; # aunque esto también funciona

source: =item 'STRING'
es_es: =item 'CADENA'

source: See L<perlsub/"Temporary Values via local()"> for details, including issues with tied arrays and hashes.
es_es: Ver L<perlsub/"Valores temporales con local()"> para más detalles, incluidas las cuestiones relativas a arrays y hash enlazadas.

source: =head2 Tru64: No threaded builds with GNU cc (gcc)
es_es: =head2 Tru64: No compilación con threaded con el GNU cc (gcc)

source: If EXPR is omitted, C<localtime()> uses the current time (as returned by time(3)).
es_es: Si EXPR se omite, C<localtime()> utiliza la hora actual (devuelta por time(3)).

source: This is B<"The Artistic License">.
es_es: Esta es B<"La Licencia Artística">.

source: open(my $fh, $arg) or warn "Can't open $arg: $!";
es_es: open(my $fh, $arg) or warn "No puedo abrir $arg: $!";

source: An illegal user-defined Unicode casemapping was specified.
es_es: Se ha especificado un mapeo Unicode de caja ilegal definido por el usuario.

source: break when 'vote'; # My vote cannot be bought
es_es: break when 'voto'; # Mo voto no puede ser comprado

source: named uops if ( ) { } elsif ( ) { } else { }
es_es: ops unarios con nombre if ( ) { } elsif ( ) { } else { }

source: (-s $file) + 1024 # correct
es_es: (-s $archivo) + 1024 # correcto

source: Consider how the pattern above detects no-match on C<((()aaaaaaaaaaaaaaaaaa> in several seconds, but that each extra letter doubles this time.
es_es: Considere cómo el patrón anterior detecta una no-coincidencia en C<((()aaaaaaaaaaaaaaaaaa> en unos segundos, pero que cada letra adicional duplica ese tiempo.

source: =head2 The API
es_es: =head2 LA API

source: Note that if layers are specified in the three-argument form, then default layers stored in ${^OPEN} (see L<perlvar>; usually set by the B<open> pragma or the switch B<-CioD>) are ignored.
es_es: Tenga en cuenta que si las capas se especifican en la forma de tres argumentos, entonces las capas por defecto almacenadas en ${^OPEN} (ver L<perlvar>; normalmente fijados por el pragma B<open> o la opción B<-CioD>) son ignoradas.

source: Returns the absolute value of its argument.
es_es: Devuelve el valor absoluto del argumento.

source: See C<(*SKIP)> for more details.
es_es: Vea C<(*SKIP)> para obtener más detalles.

source: =item size
es_es: =item tamaño

source: This means that the following secret stuff will be ignored by both the compiler and the translators.
es_es: Esto significa que el siguiente material secreto será ignorado tanto por el compilador como por los traductores.

source: It is written in the POD format (see perlpod manpage) which is specially designed to be readable as is.
es_es: Está escrito en formato POD (ver la página de manual perlpod) que está específicamente diseñado para ser legible de forma sencilla.

source: C<suidperl> has been removed.
es_es: C<suidperl> ha sido eliminado.

source: do_something_else;
es_es: hacer_algo_despues;

source: For example, certain network operations have their own blocking and timeout mechanisms, and being able to interrupt them immediately would be nice.
es_es: Por ejemplo, ciertas operaciones de red tienen sus propios mecanismos de bloqueo de tiempo de espera, y ser capaz de interrumpirles de inmediato estaría bien.

source: $_ = "I have 2 numbers: 53147";
es_es: $_ = "Tengo 2 números: 53147";

source: In scalar context or if the left operand is not enclosed in parentheses, it returns a string consisting of the left operand repeated the number of times specified by the right operand.
es_es: En el contexto escalar o si el operando izquierdo no está encerrado entre paréntesis, devuelve una cadena consistente en el operando de la izquierda repetido el número de veces especificado por el operando de la derecha.

source: I<Mastering Regular Expressions> by Jeffrey Friedl, published by O'Reilly and Associates.
es_es: I<Mastering Regular Expressions> de Jeffrey Friedl, publicado por O'Reilly y Asociados.

source: =head2 Non-threaded Perl on DG/UX
es_es: =head2 Perl sin I<threads> en DG/UX

source: Note that the EXPR can be arbitrarily complicated as long as the final operation is a hash or array key lookup or subroutine name:
es_es: Note que EXPR puede ser todo lo arbitrariamente complicada que se quiera con tal de que la operación final sea un escalar de un hash o de un array o el nombre de una subrutina:

source: Also, people can set their I/O to be by default UTF8-encoded Unicode, not bytes.
es_es: También, el personal puede poner su I/O para que sea codificado por defecto en Unicode UTF-8, y no en bytes.

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines, the pattern C<< (?PE<lt>NAMEE<gt>pattern) >> may be used instead of C<< (?<NAME>pattern) >>; however this form does not support the use of single quotes as a delimiter for the name.
es_es: B<NOTA:> Con el fin de facilitar las cosas a los programadores con experiencia en Python o motores regex PCRE, el patrón C<< (?PE<lt>NOMBREE<gt>patrón) >> puede ser usado en lugar de C<< (?<NOMBRE>patrón) >>; sin embargo, esta forma no soporta el uso de comillas simples como un delimitador para el nombre.

source: There are three forms of hooks: subroutine references, array references, and blessed objects.
es_es: Hay tres formas de enganches: referencias a subrutinas, referencias a arrays y objetos bendecidos.

source: /^$/ nothing in the string (start and end are adjacent)
es_es: /^$/ cadena vacía (principio y final contiguos)

source: It's possible to enhance the mechanism of subroutine hooks in @INC by adding a source filter on top of the filehandle opened and returned by the hook.
es_es: Es posible mejorar el mecanismo de enganche de subrutinas en @INC añadiendo un filtro de código fuente por encima del identificador de archivo abierto y devuelto por el enganche.

source: To omit an element, return an empty list ().
es_es: Para omitir un elemento, devuelva una lista vacía ().

source: C<last> cannot be used to exit a block that returns a value such as C<eval {}>, C<sub {}>, or C<do {}>, and should not be used to exit a grep() or map() operation.
es_es: C<last> no puede usarse para salir de un bloque que devuelve un valor como en C<eval {}>, C<sub {}> o C<do {}>, y no debe ser usado para salir de una operación grep() o map().

source: Support for building perl with Microsoft's 64-bit compiler has been improved.
es_es: Se ha mejorado el soporte para la compilación de perl con el compilador de 64 bits de Microsoft.

source: The values for WHENCE are C<0> to set the new position to POSITION; C<1> to set the it to the current position plus POSITION; and C<2> to set it to EOF plus POSITION, typically negative.
es_es: Los valores de DÓNDE son C<0> para establecer la nueva posición a POSICIÓN; C<1> para establecerla a la actual más POSICIÓN; y C<2> para establecerla a EOF más POSICIÓN, normalmente negativa.

# printf "version is v%vd ", $^V; # Perl's version
source: printf "version is v%vd\n", $^V; # Perl's version
es_es: printf "versión es v%vd\n", $^V; # Versión de Perl

source: y{}{} Transliteration no (but see below)
es_es: y{}{} Transliteración no (pero vea abajo)

source: "-" is also taken literally when it is at the end of the list, just before the closing "]".
es_es: "-" es también tomado literalmente cuando se encuentra al final de la lista, justo antes del "]" final.

source: If none of the above apply, for backwards compatibility reasons, the C</d> modifier is the one in effect by default.
es_es: Si no se puede aplicar ninguna de las situaciones anteriores, por razones de compatibilidad, el modificador C</d> es el que está activo de manera predeterminada.

source: while (<FILE>) {
es_es: while (<ARCHIVO>) {

source: Not all pod translators are well-behaved in this regard, and perhaps the compiler will become pickier.
es_es: No todos los traductores pod están bien entrenados a este respecto y quizá el compilador sea más quisquilloso.

source: If LOCK_NB is bitwise-or'ed with LOCK_SH or LOCK_EX, then C<flock> returns immediately rather than blocking waiting for the lock; check the return status to see if you got it.
es_es: Si LOCK_NB se combina a nivel de bit con 'or' con LOCK_SH o LOCK_EX entonces C<flock> regresa inmediatamente en vez de bloquear esperando por el cerrojo; compruebe el valor de estado devuelto para ver si lo ha conseguido.

source: The first two elements of the list must be the I<numeric> uid and gid, in that order.
es_es: Los primeros dos elementos de la lista deben ser el valor I<numérico> del uid y gid, en este orden.

source: Although exists() will return false for deleted entries, deleting array elements never changes indices of existing values; use shift() or splice() for that.
es_es: Aunque exists() devolverá falso para entradas eliminadas, eliminar elementos del array nunca cambia los índices de los valores existentes; use en su lugar shift() o splice().

source: require v5.6.1; # run time version check
es_es: require v5.6.1; # comprobación de versión en tiempo de ejecución

source: Now back to the regularly scheduled documentation...>
es_es: Ahora volvamos a la documentación normal...>

source: If you would like to know about a version dependency before you start running the program, put something like this at its top:
es_es: Si quiere saber acerca de las dependencias de la versión antes de empezar a ejecutar el programa, poner algo como esto en su parte superior:

source: The following people are known to have contributed the improvements that became Perl 5.12.3:
es_es: De las siguientes personas se sabe que han contribuido con mejoras que hicieron posible Perl 5.12.3:

source: It is, however, syntax checked at compile-time.
es_es: Será, sin embargo, comprobada la sintaxis en tiempo de compilación.

source: say $sentences;
es_es: say $sentencias;

source: Automatically calls C<srand> unless C<srand> has already been called.
es_es: Automáticamente llama a C<srand> a menos que C<srand> ya haya sido llamado.

source: For example, to pack() or unpack() a C structure like
es_es: Por ejemplo, para pack() o unpack() una estructura en C como

source: If a filter has been installed with this method, it will be invoked every time you read a key from a DBM database.
es_es: Si se ha instalado un filtro con este método, se invocará cada vez que se lea una clave de una base de datos DBM.

source: The elements we're getting from the array start with a C<$> because we're getting just a single value out of the array; you ask for a scalar, you get a scalar.
es_es: Los nombres de los elementos que obtenemos del array empiezan por C<$> porque reciben valores individuales del array; si se pide un escalar, se obtiene un escalar.

source: native floating_point --> decimal string (*)
es_es: punto flotante nativo --> cadena decimal (*)

source: Data::Dumper: option to sort hashes
es_es: Data::Dumper: opción para abreviar hashes

source: These permission values need to be in octal, and are modified by your process's current C<umask>.
es_es: Estos valores de permisos tiene que estar en octal, y son modificados por el valor de C<umask> de su proceso actual.
